{"sections":{"main":{"type":"main-article","disabled":true,"settings":{"show_date":false,"show_author":false,"show_article_tags":true,"show_sharing_icons":false,"show_twitter":false,"show_facebook":true,"show_pinterest":true,"show_featured_image":true,"full_width_image":true,"featured_image_height":"huge","enable_title_overlay":false,"overlay_style":"shadow"}},"rich_text_3YdLtm":{"type":"rich-text","blocks":{"text_PGmjVH":{"type":"text","settings":{"text":"<h1>Sneaker History - The Nike LD-1000<\/h1>","enlarge_text":false}}},"block_order":["text_PGmjVH"],"settings":{"height":"medium","text_alignment":"center","full_width":false,"color_scheme":"default"}},"rich_text_mUnWNK":{"type":"rich-text","blocks":{"text_Nk9EaR":{"type":"text","settings":{"text":"<p>The history of many sneaker models is unique and we always want to introduce you to new sneakers and their history on our Blog. <br\/><br\/>The Nike LD-1000 is such a shoe with a rich history and it was launched in 1977 as one of Nike's first running shoes. The Nike brand was only a few years old and the product range was not very large. It is therefore all the more admirable that Nike developed a shoe at this time that significantly influenced the running scene. The LD in the model name stands for Long Distance. However, it is not known whether the 1000 refers to the distance of 1000 kilometers.<\/p>","enlarge_text":false}},"image_tnzxEz":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/overkill_nike_LD-1000_blog_editorial9066.webp","image_width":700,"url":""}},"image_BMRFwy":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/overkill_nike_LD-1000_blog_editorial9074.webp","image_width":700,"url":""}},"image_76APQc":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/overkill_nike_LD-1000_blog_editorial9094.webp","image_width":700,"url":""}},"image_WM7DY9":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/overkill_nike_LD-1000_blog_editorial9095.webp","image_width":700,"url":""}},"image_Uq8CFN":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/overkill_nike_LD-1000_blog_editorial9121_copy.webp","image_width":700,"url":""}}},"block_order":["text_Nk9EaR","image_tnzxEz","image_BMRFwy","image_76APQc","image_WM7DY9","image_Uq8CFN"],"settings":{"height":"small","text_alignment":"left","full_width":false,"color_scheme":"default"}},"product_list_8eFQ6C":{"type":"product-list","settings":{"title":"Nike LD-1000","product_list":["nike-ld-1000-hm0950-001-black-sail-sesame","nike-ld-1000-sp-fq9079-400-game-royal-opti-yellow","nike-ld-1000-sp-fq9079-700-university-gold-safety-orange","nike-ld-1000-sp-fq9079-300-vintage-green-bicoastal"],"show_vendor":true,"enable_carousel":true,"grid":4,"color_scheme":"default","full_width":true}},"rich_text_cqawtg":{"type":"rich-text","blocks":{"text_8LBrnD":{"type":"text","settings":{"text":"<p>One of the special features of the Nike LD-1000 was the revolutionary \"Waffle\" sole, which was developed by Nike co-founder Bill Bowerman. This sole owes its unique structure to a waffle iron that Bowerman used in his wife's kitchen. The grippy texture gives the shoe exceptional grip and quickly became a trademark of early Nike running shoes. Bowerman was also responsible for the design of the LD-1000, which was very innovative for the time. The shoe combined a breathable mesh upper with smooth suede overlays, combining both style and function. The lightness and comfort made it particularly popular with runners looking for a shoe that would provide them with optimal support during their training sessions. The flared sole is another stand-out feature. Bowerman himself wrote in his memoirs: \"The theory was that a flared heel would reduce the torque on the leg and the pressure on the knee, thereby reducing the risk of tendonitis and other running-related ailments.\" The development was developed in close cooperation with the in-house podiatrists in the Nike laboratory. Although only good intentions were put into the development, it was realized that the flared heel posed a risk of injury to runners. Nike recalled the shoe after this discovery, revised it meticulously and could then rightly claim to have designed the best running shoe in the world at the time.<\/p>","enlarge_text":false}},"image_39QP88":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/overkill_nike_LD-1000_blog_editorial9056.webp","image_width":700,"url":""}},"text_hbFXLV":{"type":"text","settings":{"text":"<p>Another interesting detail is the LD-1000's connection to Nike history and in particular to \"Athletics West\", a track club sponsored by Nike. The club, founded by Nike founders Bill Bowerman and Phil Knight, was a hotbed for innovative sports apparel and footwear designed specifically for athletes. The LD-1000 reflected this sporting tradition and the pursuit of excellence.<\/p>","enlarge_text":false}},"image_AigmCH":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/overkill_nike_LD-1000_blog_editorial9090_2.webp","image_width":700,"url":""}},"image_wEPFKa":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/overkill_nike_LD-1000_blog_editorial9092.webp","image_width":700,"url":""}},"image_4nXM3Y":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/overkill_nike_LD-1000_blog_editorial9102.webp","image_width":700,"url":""}},"text_aGLtwe":{"type":"text","settings":{"text":"<p>After 50 years, there is now a reissue of the Nike LD-1000, which shows that the shoe is still considered a design classic today. The new edition has been given a deliberately aged design that is nostalgically reminiscent of the aesthetics of the 70s and imitates the popular vintage look. The upper material is made of breathable mesh and suede remains, while the ‘Waffle\" sole with its unrivaled grip remains a central element. The modern version also sticks to the classic colorways, such as the <em>Game Royal <\/em>and \" edition, which remains true to the retro charm. <\/p><p>Another boost to the model's popularity was certainly the collaboration between Stussy and Nike on the LD-1000, with the Good Mood label giving the model a few fresh colors and the typical Stussy touch. No wonder these versions sold out quickly. Thanks to the constant popularity of 70s retro styles, however, we will be seeing the model more often, which makes us very happy. Thanks to the simple yet stylish color scheme, it goes effortlessly with a variety of outfits, making it a perfect choice for sneaker fans who appreciate retro designs and modern functionality.<\/p>","enlarge_text":false}}},"block_order":["text_8LBrnD","image_39QP88","text_hbFXLV","image_AigmCH","image_wEPFKa","image_4nXM3Y","text_aGLtwe"],"settings":{"height":"medium","text_alignment":"left","full_width":false,"color_scheme":"default"}}},"order":["main","rich_text_3YdLtm","rich_text_mUnWNK","product_list_8eFQ6C","rich_text_cqawtg"]}