{"sections":{"main":{"type":"main-article","disabled":true,"settings":{"show_date":false,"show_author":false,"show_article_tags":true,"show_sharing_icons":false,"show_twitter":false,"show_facebook":true,"show_pinterest":true,"show_featured_image":true,"full_width_image":true,"featured_image_height":"huge","enable_title_overlay":false,"overlay_style":"shadow"}},"image_with_text_overlay_D4wNxr":{"type":"image-with-text-overlay","settings":{"image":"shopify:\/\/shop_images\/550_blog_banner.jpg","mobile_image":"shopify:\/\/shop_images\/overkill_studio_NB_BB550WGU-6.jpg","height":"adapt","height_desktop":600,"height_mobile":460,"image_link":"","full_width":true,"text_alignment":"center center","mobile_overlay_under":false,"overlay_style":"shadow"}},"rich_text_3YdLtm":{"type":"rich-text","blocks":{"text_PGmjVH":{"type":"text","settings":{"text":"<h1><strong>The New Balance BB550 is a true style icon.<\/strong><\/h1>","enlarge_text":false}}},"block_order":["text_PGmjVH"],"settings":{"height":"medium","text_alignment":"center","full_width":false,"color_scheme":"default"}},"rich_text_bXnM7d":{"type":"rich-text","blocks":{"text_zwthrm":{"type":"text","settings":{"text":"<p>Today we want to give you the history of a classic basketball sneaker that has been one of the most hyped shoes ever since its re-release in September 2020 - the New Balance BB550. It's thanks to Aimé Leon Dore's mastermind Teddy Santis that the basketball performance shoe, which originally launched in 1989, is enjoying a second spring. Santis reportedly discovered the New Balance P550 (then P for performance, now BB for basketball) in an old Japanese catalog while looking for a model for another collaboration between his brand ALD and New Balance. The image in the catalog convinced Santis so much that they went in search of an original pair to have the shoe not only figuratively but also physically available for the replica. Apparently, they found a pair of P550s, so New Balance was able to launch a proper retro version together with Aimé Leon Dore in 2020.<br\/><br\/>The designer of the original shoe was the legend, Steven Smith. His brief was to create a shoe that was based on New Balance's P740 basketball performance shoe. Sources say this didn't need to be a high-performance shoe, just something that would meet the basketball needs of high school students and college ballers. The result was the P650, the high version of the shoe from which Smith then developed the 550. Basketball shoes in the 1980s and 1990s were primarily high-cut to prevent ankle injuries - loosely based on the motto: high basketball shoes = better ankle protection. Flat-cut basketball shoes were rather the exception at that time so the P550 found little appeal among basketball players and disappeared again from New Balance's product range after only a few years. So until now, Teddy Santis came along to lift the P550 out of obscurity and turn it into the modern retro classic we love so much today. As mentioned above, the silhouette made its comeback in September 2020 as part of Aimé Leon Dore's \"International Friendship Through Basketball\" collection. The collection featured a total of four colorways, all of which sold out immediately and are still highly coveted today.<br\/><br\/>At Overkill, we can offer 14 different colorways of the BB550. From the classic OG colorway to more unusual colors and materials, there is something for every taste. The shoe is and remains an eye-catcher, which meets the zeitgeist with its different layers. Like many other basketball sneakers of the 80s, the BB550 has a curved overlay on the heel, the so-called quarter panel. An interesting distinction from most other silhouettes is the heel tab, which is mesh on this shoe. The mudguard also features a unique feature: it doesn't run evenly around the perforated toebox, but is curved, getting wider towards the little toe and extending up to the toebox. The lateral overlay in the midfoot area originally served as reinforcement. The part where the 550 is embroidered has the fantastic name \"Sway Bar\". The embroidery described always matches in color with an area of the shoe. The tongue label is also beautiful. It's basically a copy of the original 1989 tongue label, which features \"new balance 550\" lettering, as well as larger overlapping circles that lead into a basketball in the foreground with the NB logo on it - style perfection.<br\/><br\/>Test: Ernie Beckmann<\/p>","enlarge_text":false}},"image_HcWQDy":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/overkill_studio_nb_bb550vtb_bb550vta-100.jpg","image_width":700,"url":""}},"image_hgVdff":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/overkill_studio_nb_bb550wbg-100.jpg","image_width":700,"url":""}},"image_4g4XtQ":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/overkill_studio_nb_bbw550wa-102.jpg","image_width":700,"url":""}},"image_4hKebj":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/overkill-studio-newbalance-bb550pb1-bb550pwa-bb550pwb-_2.jpg","image_width":700,"url":""}},"image_CrE7CC":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/overkillstudio_newbalance_550_BB550HA1_BB550SE1-2.jpg","image_width":700,"url":""}},"image_abaqyz":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/overkill-studio-newbalance-bbw550bc-_4.jpg","image_width":700,"url":""}}},"block_order":["text_zwthrm","image_HcWQDy","image_hgVdff","image_4g4XtQ","image_4hKebj","image_CrE7CC","image_abaqyz"],"settings":{"height":"medium","text_alignment":"left","full_width":false,"color_scheme":"default"}}},"order":["main","image_with_text_overlay_D4wNxr","rich_text_3YdLtm","rich_text_bXnM7d"]}