{"sections":{"main":{"type":"main-article","disabled":true,"settings":{"show_date":false,"show_author":false,"show_article_tags":true,"show_sharing_icons":false,"show_twitter":false,"show_facebook":true,"show_pinterest":true,"show_featured_image":true,"full_width_image":true,"featured_image_height":"huge","enable_title_overlay":false,"overlay_style":"shadow"}},"image_with_text_overlay_D4wNxr":{"type":"image-with-text-overlay","settings":{"image":"shopify:\/\/shop_images\/Recap_adidas_collective.webp","mobile_image":"shopify:\/\/shop_images\/overkill_adidas_curators_recap_blogpost_4x5-23_0b72df44-6037-4ef1-8148-c335a061f6f4.jpg","height":"adapt","height_desktop":600,"height_mobile":460,"image_link":"","full_width":true,"text_alignment":"center center","mobile_overlay_under":false,"overlay_style":"shadow"}},"rich_text_3YdLtm":{"type":"rich-text","blocks":{"text_PGmjVH":{"type":"text","settings":{"text":"<h1><strong>Adidas Originals x <br\/>“The Collective – Court to Concrete“ Pre-Release Event Recap<\/strong><\/h1>","enlarge_text":false}}},"block_order":["text_PGmjVH"],"settings":{"height":"medium","text_alignment":"center","full_width":false,"color_scheme":"default"}},"rich_text_mUnWNK":{"type":"rich-text","blocks":{"text_Nk9EaR":{"type":"text","settings":{"text":"<p>On Friday 28th July, our Overkill store in Berlin once again hosted a real sneaker event. It was about the pre-release of the collaboration between adidas Originals and a group of sneaker collectors, which ran under the motto \"The Collective - Court to Concrete\". We have already informed you in detail about the collaboration in a previous post, but here is a summary of the most important information: The Collective are four OG sneakerheads who have been contributing to and enriching sneaker culture in various ways for many years and have made a name for themselves as collectors of vintage sneakers from the 80s and 90s over the last two decades. They are Julia Schoierer, better known as Sneakerqueen from Berlin, Erniepunk aka Ernie Beckmann from Braunschweig, Tom \"Tommy Triggah\" Römer from the Netherlands and Scott Frederick from New York, who has been successfully running the blog Defy.NewYork.com since 2007. Over the past two years, they have worked together on two legendary silhouettes from adidas' rich basketball archive. At our event, their designs of the adidas Rivalry Low 86 and the adidas Conductor were released, both of which were produced in limited quantities.<\/p>","enlarge_text":false}},"image_tnzxEz":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/overkill_adidas_curators_recap_blogpost_4x5-38.jpg","image_width":700,"url":""}},"text_XhGXCD":{"type":"text","settings":{"text":"<p>Our store at Köpenicker Straße provided a great setting for the event. To celebrate the day, we decorated one of our shop windows with the tissue paper design of the two sneakers and a huge \"The Collective\" logo. In addition to delicious mini burgers and ice lollies with \"The Collective\" stickers, the chilled drinks sponsored by us and the finest tunes from deadHYPE Berns and TERIYAKI put everyone in a good mood. In the entrance area of the upper floor, Julia and Ernie had curated a small exhibition on the theme of their collabo, where vintage apparel and basketball shoes from the Patrick Ewing collection by adidas and Run DMC were on display. On the other hand, various samples of the newly released sneakers were exhibited, showing the different stages of their collaboration with adidas. As the icing on the cake, we were able to take a look at the respective Family & Friends shoes of the four protagonists, which are also part of this collabo but are not available for purchase. <\/p>","enlarge_text":false}},"image_j7Haqn":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/overkill_adidas_curators_recap_blogpost_4x5-21.jpg","image_width":700,"url":""}},"image_bfGbAM":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/overkill_adidas_curators_recap_blogpost_4x5_4601543e-b2d9-440d-bf8c-8e7cf3c3b32a.jpg","image_width":700,"url":""}},"text_iUiya6":{"type":"text","settings":{"text":"<p>The first buyers of the Conductor and the Rivalry received a T-shirt branded with the Overkill and \"The Collective\" logos and a \"The Collective\" Dust Bag for free with their purchase. The original Dust Bag from 1986 was also on display in the aforementioned exhibition on the upper floor.<\/p>","enlarge_text":false}},"image_KKpXjE":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/overkill_adidas_curators_recap_blogpost_4x5-16.jpg","image_width":700,"url":""}},"text_zkF4jy":{"type":"text","settings":{"text":"<p>Shortly after the event started at 5 p.m., the store and especially the pavement in front of our shop began to fill up in the best weather. Our staff constantly provided chilled drinks, so the atmosphere was always good. The composition of our guests was particularly cool this time. In addition to long-established collectors with a personal connection to the Collective team, there were also a lot of young sneaker lovers who wanted to see the result of the collaboration between adidas Originals and the Collective. And it has to be said that both silhouettes were well received, as several sizes of both sneakers are already sold out in our shop. So if you want to make sure you don't miss out on this collabo, you shouldn't wait too long to get your hands on them. With this in mind, we are already looking forward to the next great event in our shop.<\/p>","enlarge_text":false}},"image_aGHWXU":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/overkill_adidas_curators_recap_blogpost_4x5-23.jpg","image_width":700,"url":""}}},"block_order":["text_Nk9EaR","image_tnzxEz","text_XhGXCD","image_j7Haqn","image_bfGbAM","text_iUiya6","image_KKpXjE","text_zkF4jy","image_aGHWXU"],"settings":{"height":"small","text_alignment":"left","full_width":false,"color_scheme":"default"}}},"order":["main","image_with_text_overlay_D4wNxr","rich_text_3YdLtm","rich_text_mUnWNK"]}