{"sections":{"main":{"type":"main-article","disabled":true,"settings":{"show_date":false,"show_author":false,"show_article_tags":true,"show_sharing_icons":false,"show_twitter":false,"show_facebook":true,"show_pinterest":true,"show_featured_image":true,"full_width_image":true,"featured_image_height":"huge","enable_title_overlay":false,"overlay_style":"shadow"}},"rich_text_3YdLtm":{"type":"rich-text","blocks":{"text_PGmjVH":{"type":"text","settings":{"text":"<h1><strong>50 years of PUMA Clyde - <br\/>an icon celebrates anniversary<\/strong><\/h1>","enlarge_text":true}}},"block_order":["text_PGmjVH"],"settings":{"height":"medium","text_alignment":"center","full_width":false,"color_scheme":"default"}},"rich_text_mUnWNK":{"type":"rich-text","blocks":{"text_Nk9EaR":{"type":"text","settings":{"text":"<p>For the 50th anniversary of the Clyde, PUMA is releasing a whole range of high-quality and cool versions of the basketball classic this year. New in are three original colorways from 1973, the year the signature model of NBA legend Walt \"Clyde\" Frazier first hit the market.<br\/><br\/>Now under a lifetime contract with PUMA, \"Clyde\" Frazier was the first NBA player since Chuck Taylor in 1917 to have his own shoe named after him by a sporting goods manufacturer in the early 1970s. Frazier was interesting for PUMA on the one hand because he was an outstanding point guard for the New York Knicks. But on the other hand, he was \"fly\" early on and was considered a \"fashion icon\" with a fancy style. This was not always to the liking of the NBA's upper echelons, as his look was sometimes based on that of the metropolitan pimps, which could have harmed the league's image. Legend has it that Frazier took the PUMA Suede, which came out in the late 1960s and customized it. PUMA thought this was so cool that they made the Suede a little tighter according to Frazier's ideas and released it in several colorways Frazier had requested, then unceremoniously renamed the shoe, Clyde. In the emerging hip-hop scene at the time, the PUMA Clyde, like the PUMA Suede before, was a hip shoe, because it could be easily combined with the rest of the outfit, preferably tracksuits, due to the many color variations. In particular, writers and B-boys memorialized the shoe in the 70s, captured among others by the legendary photographer Martha Cooper, whose iconic photographs are still exhibited worldwide. But back to \"Clyde\" Frazier and his clothing style. Today, the website clydesofly.com is dedicated to the suits Frazier wore as a commentator at Madison Square Garden during New York Knicks games. Despite his 1977 move to the Cleveland Cavaliers, Frazier is still a Knickerbocker through and through, not least because he won NBA championships with the team from the Big Apple in 1970 and 1973.<br\/><br\/>With the three original colorways, Red\/White, Obsidian\/White, and Green\/White, PUMA has recently paid tribute to the legacy of the Clyde. The uppers of the OG versions come in the original shape and are made of premium suede today, just like back then. The tongue, equipped with a woven label, is also made of suede. The upper is emblazoned with a white Formstrip that converges at the heel. Above the Formstrip is the PUMA lettering in gold along with a jumping big cat and the familiar Clyde lettering. The white of the usual rubber sole is slight \"off\" and bears the name \"Pristine\". <br\/><br\/>Besides these three PUMA Clyde OG, you can find more Clydes in our online shop, as well as in our stores in Berlin and Cologne. Come by and check them out.<br\/><br\/>Text: <a href=\"https:\/\/www.instagram.com\/erniepunk\/\" target=\"_blank\">Ernie Beckmann<\/a><\/p>","enlarge_text":false}},"image_tnzxEz":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/overkill_puma_clyde_spati-9.jpg","image_width":700,"url":""}},"image_ikYy8i":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/overkill_puma_clyde_spati-13.jpg","image_width":700,"url":""}},"image_zqgGcQ":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/overkill_puma_clyde_spati-11.jpg","image_width":700,"url":""}},"image_eaKeei":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/overkill_puma_clyde_spati-15.jpg","image_width":700,"url":""}},"image_pbqJki":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/overkill_puma_clyde_spati-19.jpg","image_width":700,"url":""}},"image_gwMtj8":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/overkill_puma_clyde_spati-26.jpg","image_width":700,"url":""}}},"block_order":["text_Nk9EaR","image_tnzxEz","image_ikYy8i","image_zqgGcQ","image_eaKeei","image_pbqJki","image_gwMtj8"],"settings":{"height":"small","text_alignment":"left","full_width":false,"color_scheme":"default"}}},"order":["main","rich_text_3YdLtm","rich_text_mUnWNK"]}