{"sections":{"image_with_text_overlay_D4wNxr":{"type":"image-with-text-overlay","settings":{"image":"shopify:\/\/shop_images\/air-force-1.webp","height":"adapt","height_desktop":600,"height_mobile":460,"image_link":"","full_width":true,"text_alignment":"center center","mobile_overlay_under":false,"overlay_style":"shadow"}},"main":{"type":"main-article","disabled":true,"settings":{"show_date":false,"show_author":false,"show_article_tags":true,"show_sharing_icons":false,"show_twitter":false,"show_facebook":true,"show_pinterest":true,"show_featured_image":true,"full_width_image":true,"featured_image_height":"huge","enable_title_overlay":false,"overlay_style":"shadow"}},"rich_text_3YdLtm":{"type":"rich-text","blocks":{"text_PGmjVH":{"type":"text","settings":{"text":"<p><strong>15 facts why the Nike Air Force 1 is the most popular sneaker of all time.<\/strong><\/p>","enlarge_text":true}}},"block_order":["text_PGmjVH"],"settings":{"height":"small","text_alignment":"center","full_width":false,"color_scheme":"default"}},"rich_text_mUnWNK":{"type":"rich-text","blocks":{"text_Nk9EaR":{"type":"text","settings":{"text":"<p>Without exaggerating, the Nike Air Force 1 is THE king of sneakers par excellence. The Nike sneaker came out in 1982 as the Air Force 1 and was originally designed as a high-top basketball sneaker. So here are 15 Fun Facts about the Nike Air Force 1 that you may not have known.<\/p><p><strong>#1 Who designed the Air Force 1?<br\/><\/strong>• The designer of the Air Force 1 is Bruce Kilgore, who is actually a sculptor. He found inspiration in Nike hiking boots and their features, mobility, and stability for the feet, among other things.<\/p><p><strong>#2 The Nike Air Force 1, from the court to the street<br\/><\/strong>• Before the AF1 became the epitome of sneaker culture, it was a performance sneaker. It was also the first basketball sneaker to feature Nike's AIR technology when it debuted in 1982.<\/p><p><strong>#3 Which color of Nike Air Force 1 is the most popular?<br\/><\/strong>•  The first Air Force 1 was white with a neutral gray for the outsole and Swoosh. To this day, Nike's all-white Air Force 1 is the best seller. However, the all-black AF1 is also popular, though in the end, whatever you like is fair game when it comes to color.<\/p><p><strong>#4 Why does the Air Force 1 have such a thick sole?<br\/><\/strong>• The Air Force 1's midsole was made so high by the air cushion that Kilgore based it on the statics of Notre Dame in Paris to ensure stability.<strong>#5 Speaking of the Air Force 1's sole.<\/strong>• The Air Force 1 was the first basketball sneaker to feature a Cup sole. All of the players who were able to test and play with the shoe loved the sole. It is incredibly durable and also very comfortable thanks to the AIR cushion.<\/p><p><strong>#6 The Air Force 1 as inspiration for others<br\/><\/strong>• One of the first wear testers of the model was none other than Tinker Hatfield. The Air Force 1 was also the initial spark for Hatfield to become a sneaker designer, as he was actually an architect.<\/p><p><strong>#7 The design of the AF1 is timeless and simple.<br\/><\/strong>• Initially, the model was mocked internally at Nike as the Michelin Man. The shoe, chunky by the standards of the time, didn't have only fans, but that didn't slow down the success of the Air Force 1. The first prototype of the AF1 has mesh instead of perforated leather on the side panel and no perforated toe box.<\/p><p><strong>#8 Why is a Nike sneaker actually called Air Force 1?<br\/><\/strong>• The model owes its name to the American president's plane. It was meant to give the buyer an exclusive and high-end feel.<\/p><p><strong>#9 Nike Air Force 1 High, Mid, or Low?<br\/><\/strong>• When it debuted, the AF1 was only available as a high-top sneaker. From the year 1983, there was the Air Force 1 Low, which is the flat version of the classic to have. To date, the most popular version of the model. The Nike Air Force 1 Mid has been available since 1994, it is cut slightly lower than the high-top.<\/p>","enlarge_text":false}},"image_akeFJN":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/morph_3.gif","image_width":700,"url":""}},"text_b3KPkb":{"type":"text","settings":{"text":"<p><strong>#10 Air Force 1, the Three Amigos, and the Color of the Month.<br\/><\/strong>• In 1984, barely two years after its debut, the Air Force 1 disappeared from Nike's portfolio again. Thanks to the persistence of three Baltimore-based retailers, the Air Force 1 experienced its second spring. They presented a concept to Nike and proposed new colors, including white\/royal blue and white\/chocolate brown. This idea was called Colors of the Month by the retailers known as the Three Amigos. This unique approach was the precursor to things that are now standard in the sneaker world: regional exclusives, limited edition products, and Quickstrike releases.<\/p><p><strong>#11 Nike Air Force 1, the success story continues.<br\/><\/strong>• Nike does over $800 million in sales a year with the Air Force 1 and sells 12 million pairs annually. <\/p><p><strong>#12 Which Nike Air Force 1 is the best?<br\/><\/strong>• In its 40+ year history, there have been more than 2000 different versions of the Air Force 1 sneaker. Even though some of them are hard to come by, in the end, everyone can find the right Air Force 1 for them. The timeless design makes the model popular among all groups of buyers. <\/p><p><strong>#13 Mastermind Virgil Abloh and his Off-White x Nike Collaborations<br\/><\/strong>• Before his untimely death, Virgil Abloh completely transformed the sneaker scene. With his unique design approach, he managed to put his stamp on even a simple sneaker like the Air Force. Especially his Nike collaborations with his Off-White label triggered real hype. Virgil Abloh has also transformed the Air Force 1 into a luxury fashion sneaker. In his role as creative director, he brought together the French luxury label Louis Vuitton and Nike to create 47 different versions.<\/p><p><strong>#14 Which is the most expensive Air Force 1?<br\/><\/strong>• Of course, it has to be one of the 47 from Abloh's Louis Vuitton x Nike Air Force 1 collection. At a recent Sothebys auction, the hammer fell on one of the pairs at an incredible $352,800.<\/p><p><strong>#15 The 25th Anniversary of the Air Force 1 in 2007<\/strong><br\/>• Speaking of luxury, it was available on Air Force 1 models before. For the anniversary, Nike presented two luxury versions of the Air Force 1, both handcrafted in Italy from snake and crocodile leather.By Nike standards, very little marketing was done for the Air Force 1 in the 80s. Advertising enough at the time was that the NBA's best players wore the model. But the Air Force 1 was not only the first choice for professional players, many recreational athletes also appreciated the features of the AF1. However, the Air Force 1 quickly moved from the court to the streets and became the number-one sneaker around the globe. You just can't imagine a sneaker world without this shoe, the Air Force 1 is a legend and will hopefully stay with us for a long time.In the past decades, the Nike Air Force 1 has experienced various evolutions. Here you have an overview of the most important model versions of the AF1.<\/p>","enlarge_text":false}}},"block_order":["text_Nk9EaR","image_akeFJN","text_b3KPkb"],"settings":{"height":"small","text_alignment":"left","full_width":false,"color_scheme":"default"}},"gallery_H4yibN":{"type":"gallery","blocks":{"media_8AaCjf":{"type":"media","settings":{"image":"shopify:\/\/shop_images\/AF1-post-1.jpg","enlarge_media":false,"subheading":"","title":"","button_label":"","link":"","text_alignment":"bottom left"}},"media_3cmCtm":{"type":"media","settings":{"image":"shopify:\/\/shop_images\/AF1-post-2.jpg","enlarge_media":false,"subheading":"","title":"","button_label":"","link":"","text_alignment":"bottom left"}},"media_6Uht6E":{"type":"media","settings":{"image":"shopify:\/\/shop_images\/AF1-post-3.jpg","enlarge_media":false,"subheading":"","title":"","button_label":"","link":"","text_alignment":"bottom left"}},"media_ximcE4":{"type":"media","settings":{"image":"shopify:\/\/shop_images\/AF1-post-4.jpg","enlarge_media":false,"subheading":"","title":"","button_label":"","link":"","text_alignment":"bottom left"}}},"block_order":["media_8AaCjf","media_3cmCtm","media_6Uht6E","media_ximcE4"],"settings":{"grid_desktop":4,"grid_mobile":"1","height":"adapt","desktop_image_height":1000,"mobile_image_height":400,"title_size":150,"title_size_mobile":22,"enable_margin":true,"enable_row_spacing":true,"full_width":true,"color_scheme":"default","enable_carousel":true,"overlay_style":"full","button_style":"primary"}},"featured_collection_CyhtPy":{"type":"featured-collection","settings":{"title":"","collection":"nike-air-force-1","show_vendor":false,"enable_carousel":true,"grid":5,"rows":5,"color_scheme":"default","show_view_all":false,"full_width":true}},"image_with_text_overlay_mBHHK3":{"type":"image-with-text-overlay","settings":{"image":"shopify:\/\/shop_images\/af1-special-bottom.webp","height":"adapt","height_desktop":600,"height_mobile":460,"image_link":"","full_width":true,"text_alignment":"center center","mobile_overlay_under":false,"overlay_style":"shadow"}}},"order":["image_with_text_overlay_D4wNxr","main","rich_text_3YdLtm","rich_text_mUnWNK","gallery_H4yibN","featured_collection_CyhtPy","image_with_text_overlay_mBHHK3"]}