{"sections":{"main":{"type":"main-article","disabled":true,"settings":{"show_date":false,"show_author":false,"show_article_tags":true,"show_sharing_icons":false,"show_twitter":false,"show_facebook":true,"show_pinterest":true,"show_featured_image":true,"full_width_image":true,"featured_image_height":"huge","enable_title_overlay":false,"overlay_style":"shadow"}},"image_with_text_overlay_BEAamT":{"type":"image-with-text-overlay","blocks":{"heading_MJmUbw":{"type":"heading","settings":{"title":"NOT YOUR AVERAGE SNEAKER","heading_max_width":15,"title_size":84,"title_size_mobile":32,"use_h1":false}}},"block_order":["heading_MJmUbw"],"settings":{"image":"shopify:\/\/shop_images\/blog_banner_neu.webp","height":"adapt","height_desktop":600,"height_mobile":460,"image_link":"","full_width":true,"text_alignment":"center center","mobile_overlay_under":false,"overlay_style":"shadow"}},"rich_text_3YdLtm":{"type":"rich-text","blocks":{"text_PGmjVH":{"type":"text","settings":{"text":"<h1>These sneakers are anything but ordinary.<\/h1>","enlarge_text":false}}},"block_order":["text_PGmjVH"],"settings":{"height":"medium","text_alignment":"center","full_width":false,"color_scheme":"default"}},"rich_text_CPKDHq":{"type":"rich-text","blocks":{"text_rtreLC":{"type":"text","settings":{"text":"<p>Today we want to take a look at a few models that are not the classic sneaker silhouettes. In the world of fashion, anything goes, you just have to dare. The ugly sneaker trend is also a big topic in 2024. Light chunky trainers or classic dad trainers are still popular styles. With our selection of, let's say extraordinary, we want to show you the entire spectrum. Stand out from the crowd and be bold in your choice of footwear.<\/p>","enlarge_text":false}}},"block_order":["text_rtreLC"],"settings":{"height":"medium","text_alignment":"left","full_width":false,"color_scheme":"default"}},"rich_text_mUnWNK":{"type":"rich-text","blocks":{"image_tnzxEz":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/overkill_notyoureverydaysneaker_14_Kopie.webp","image_width":700,"url":"https:\/\/www.overkillshop.com\/products\/satisfy-x-crocs-quick-trail-209628-2g9-tumbleweed"}},"text_Nk9EaR":{"type":"text","settings":{"text":"<p><strong>Satisfy x Crocs Quick Trail<\/strong><\/p><p>Crocs in general certainly deserve to be called ugly trainers. Even if you can't call the classic slides sneakers, <a href=\"\/collections\/crocs\" title=\"Crocs\">Crocs<\/a> have made a name for themselves in the shoe world. At the latest with the models designed by Salehe Bembury, Crocs has also become a household name in the streetwear and sneaker scene. The Parisian label Satisfy has been around since 2015 and has created a lifestyle around the pure performance sport of running. With the Quick Trail, they have created a model that can be described as an outdoor and water shoe. The upper material in the lower section is made of lightweight plastic and has holes, as we know it from Crocs slides. The upper is constructed like a sock and offers additional support and comfort. By removing the drainage holes in the sole, the shoes have become more suitable for the road. The only question that remains is whether you are brave enough to wear the <a href=\"\/products\/satisfy-x-crocs-quick-trail-209628-2g9-tumbleweed\" title=\"Quick Trail\">Satisfy x Crocs Quick Trail<\/a> on the streets!<\/p>","enlarge_text":false}},"image_cxfUNJ":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/overkill_notyoureverydaysneaker_20_Kopie.webp","image_width":700,"url":"https:\/\/www.overkillshop.com\/products\/the-north-face-thermoball-traction-mule-v-tnf-black-tnf-white-nf0a3uznky4"}},"text_CxV9YK":{"type":"text","settings":{"text":"<p><strong>The North Face Thermoball Traction Mule<\/strong><\/p><p>Haven't you always wanted shoes that really keep your feet warm? The North Face has just the model for you with the <a href=\"\/products\/the-north-face-thermoball-traction-mule-v-nf0a3uznvju-hawthorne-khaki-tnf-black\" title=\"M Thermoball Traction Mule V\">Thermoball Slide<\/a>. The model was originally designed for use after strenuous activities such as hiking or skiing. The TNF Thermoball Mule is a comfortable slipper to keep your feet warm and cosy. The model is like a <a href=\"\/products\/the-north-face-1996-retro-nuptse-jacket-nf0a3c8d92a-summit-navy-tnf-black\" title=\"1996 Retro Nuptse Jacket\">The North Face down jacket <\/a>for your feet. The upper is made of nylon and the Thermoball insulation is a synthetic alternative to down. The inside of the shoe is lined with fleece for extra comfort. The Traction Mule from The North<br\/>Face is versatile. While the <a href=\"\/products\/the-north-face-m-nse-tent-mule-iii-nf00awmgb8-zinc-grey-griffin-grey\" title=\"m nse tent mule iii\">TNF Tent Mule<\/a> is only suitable for indoor use as a slipper, the Traction Mule has an outdoor sole profile. The Thermoball Mule is available in various colours, including classic black, as well as eye-catching patterns such as Woodland Camo. <\/p>","enlarge_text":false}},"image_crJGxA":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/overkill_notyoureverydaysneaker_4_Kopie.webp","image_width":700,"url":"https:\/\/www.overkillshop.com\/products\/nike-clogposite-fq8257-300-light-orewood-brown-light-orewood-brown"}},"text_bfxiVW":{"type":"text","settings":{"text":"<p><strong>Nike Clogposite<\/strong><\/p><p>The <a href=\"\/products\/nike-clogposite-fq8257-300-light-orewood-brown-light-orewood-brown\" title=\"Clogposite\">Nike Clogposite<\/a> is a unique shoe that has its origins in the early 2000s. Originally introduced as a mule version of the Nike Flightposite, the Clogposite combines the distinctive wavy design and cushioning of the basketball sneaker. With this blend of sporty functionality, casual style and futuristic design, the Clogposite stands out from the <a href=\"\/collections\/nike\" title=\"Nike\">Nike sneaker<\/a> range. It has to be said that the Nike Foamposite basketball sneaker already caused a stir with its progressive design. Turning this <a href=\"\/collections\/high-tops-men\" title=\"High Tops Men\">high-top sneaker<\/a> into a sneaker slide is a very bold idea. The sometimes extremely striking colorways make the Nike Clogposite even more of an eye-catcher. The Nike Clogposite is aimed at anyone who wants to make a statement, be it as a sneakerhead or as a lover of innovative shoe designs. With its return, Nike taps into both the nostalgia of the early 2000s and the current trend for practical, stylish clogs, mules and <a href=\"\/collections\/slides-sandals-men\" title=\"Slides & Sandals Men\">sneaker slides.<\/a><\/p>","enlarge_text":false}},"image_Df4Dqd":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/overkill_notyoureverydaysneaker_21_Kopie.webp","image_width":700,"url":"https:\/\/www.overkillshop.com\/products\/adidas-crazy-iiinfinity-ih2663-orbit-grey-chalk-white-wonder-white"}},"text_J6w4cW":{"type":"text","settings":{"text":"<p><strong>adidas Crazy IIInfinity<\/strong><\/p><p>Is it a car, is it an airplane, no it's a basketball sneaker! The story of the model begins in 2000, when adidas released The Kobe. It was the first signature sneaker for basketball legend Kobe Bryant of the Los Angeles Lakers. After Kobe and adidas went their separate ways, the model was renamed adidas Crazy 1 and the name fits perfectly. The design of the model was exceptional even by the standards of the time. The inspiration for the design was the Audi TT Roadster that Kobe Bryant was driving at the time. The futuristic appearance of the model made all fans of <a href=\"\/collections\/basketball-court-men\" title=\"Basketball & Court Men\">basketball sneakers<\/a> gasp - there was simply nothing like it before. The <a href=\"\/products\/adidas-crazy-iiinfinity-ih2663-orbit-grey-chalk-white-wonder-white\" title=\"Crazy Iiinfinity\">adidas Crazy IIInfinity<\/a>, which could also be referred to as the Crazy III, hence the pun, is the logical continuation of this model. The model has a cover with a zip that conceals the laces. On the sides, the obligatory three stripes are indicated as indentations and there is a small shell detail on the toe, which is based on another adidas basketball sneaker, the adidas Superstar. <\/p>","enlarge_text":false}},"image_wHUxBN":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/overkill_notyoureverydaysneaker_12_Kopie.webp","image_width":700,"url":"https:\/\/www.overkillshop.com\/products\/adidas-mocaturf-adventure-magic-earth-magic-earth-wild-sepia-gy9853"}},"text_bCJUGW":{"type":"text","settings":{"text":"<p><strong>adidas Mocaturf Adventure<\/strong><\/p><p>Designing new sneaker models by combining the upper and lower shoe from two completely different categories is a tried and tested recipe. However, there is a great risk of getting it completely wrong, but with the <a href=\"\/products\/adidas-mocaturf-adventure-magic-earth-magic-earth-wild-sepia-gy9853\" title=\"Mocaturf Adventure\">adidas Mocaturf Adventure<\/a>, this idea works. As you can see from the name, the upper is modelled on a moccasin, with the addition of laces. The upper material is made of suede, which gives the model a high-quality appearance. The adventure in the model’s name refers to the sole. The midsole provides sufficient cushioning, while the outsole with its coarse tread provides the necessary grip. So-called hybrid sneakers are a popular way to present classic models in a new context and to encourage buyers to add these models to their shopping basket. <\/p>","enlarge_text":false}},"image_CKURTD":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/overkill_notyoureverydaysneaker_24_Kopie.webp","image_width":700,"url":"https:\/\/www.overkillshop.com\/products\/puma-plexus-puma-black-varsity-green-386329-02"}},"text_pNW8bp":{"type":"text","settings":{"text":"<p><strong>Puma Plexus<\/strong><\/p><p>Puma also has a few interesting, non-standard sneaker silhouettes in its portfolio. The brand is currently riding the retro wave of the 90s and releasing archive models from this period, such as the <a href=\"\/collections\/puma-speedcat\" title=\"Puma Speedcat\">Puma Speedcat<\/a> or the <a href=\"\/products\/puma-mostro-ecstasy-397328-03-ignite-blue-bluemazing\" title=\"Mostro Ecstasy\">Puma Mostro<\/a>. The latter model was also the basis for designing the <a href=\"\/products\/puma-plexus-puma-black-varsity-green-386329-02\" title=\"Plexus\">Puma Plexus<\/a> as a future classic sneaker. The mix of materials and the progressive design symbolize this. The model features a unique lacing system that emphasizes the Puma form stripe as well as additional round bands that adorn the upper. With the chunky outsole, divided into two sections, and the plastic toe cap, the Puma Plexus is based on the sneaker design language of past years. Thanks to the sock-like construction inside the shoe, the oversized <a href=\"\/collections\/puma\" title=\"Puma\">Puma sneaker<\/a> still offers good support.<\/p>","enlarge_text":false}},"image_mRAeL7":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/overkill_notyoureverydaysneaker_11_Kopie.webp","image_width":700,"url":"https:\/\/www.overkillshop.com\/products\/reebok-future-club-c-black-dusty-blue-rmia037c99mat0011042"}},"text_MJJxM3":{"type":"text","settings":{"text":"<p><strong>Reebok Future Club C<\/strong><\/p><p>The <a href=\"\/collections\/reebok-club-c\" title=\"Reebok Club C\">Club C<\/a> from Reebok was the brand's bestseller for many years. The epitome of the <a href=\"\/collections\/white-sneakers\" title=\"White Sneakers\">white sneaker<\/a> came onto the market in countless variations, whereby only one subtle contrasting color was ever added. With the <a href=\"\/products\/reebok-future-club-c-beige-light-green-rmia037c99mat0016154\" title=\"Future Club C\">Reebok Future Club C<\/a> presented here, the brand now presents us with the future orientated version of this classic. The Future Club C is characterized by its minimalist design, which preserves the heritage of the original while integrating futuristic elements. The design of the shoe looks as if it was made from a single mold. The sole and upper are made of a soft plastic mix and geometric cut-outs shape the silhouette of the Reebok Future Club C. Various 3D-style design elements and the sock-like neoprene inner shoe are further indicators that the Reebok Future Club C should not be missing from this list.<\/p>","enlarge_text":false}},"image_4j3TWR":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/overkill_notyoureverydaysneaker_16_Kopie.webp","image_width":700,"url":"https:\/\/www.overkillshop.com\/products\/saucony-tombogo-x-saucony-butterfly-brown-s70828-2"}},"text_ViDXEr":{"type":"text","settings":{"text":"<p><strong>Tombogo x Saucony Butterfly<\/strong><\/p><p>The traditional American brand <a href=\"\/collections\/saucony\" title=\"Saucony\">Saucony<\/a> is recognized worldwide for its running sneakers. Together with designer Tommy Bogo, a new model has been created that definitely deserves a mention here. The result is a new silhouette that combines functionality and performance. The <a href=\"\/products\/saucony-tombogo-x-saucony-butterfly-black-s70828-1\" title=\"Tombogo x Saucony Butterfly\">Butterfly sneaker<\/a> has an eye-catching design inspired by the transformation and metamorphosis of a butterfly. This multifunctional Saucony sneaker consists of two individual parts. You can remove the sock construction made of breathable mesh and what remains is a shoe in a clog design with large cut-outs. This gives you the choice of how you prefer to wear the trainers. The thick midsole ensures perfect cushioning and the outsole provides the necessary grip. Designer Tommy Bogo is driven by the desire to create products that are \"out-of-the-box\" and the Saucony Butterfly definitely deserves this seal of approval.<\/p>","enlarge_text":false}},"image_6anT6b":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/overkill_notyoureverydaysneaker_1_Kopie.webp","image_width":700,"url":"https:\/\/www.overkillshop.com\/products\/asics-otto958-x-asics-gel-flexkee-pro-1201a921-001-black-pure-silver"}},"text_CWqziN":{"type":"text","settings":{"text":"<p><strong>Otto958 x Asics Gel-Flexkee Pro<\/strong><\/p><p>The Japanese brand <a href=\"\/collections\/asics\" title=\"Asics\">Asics<\/a> is known for its extremely aesthetic trainers. The brand's <a href=\"\/collections\/y2k-sneaker\" title=\"Y2K Sneaker\">Y2K running sneakers <\/a>in particular can be seen everywhere. Asics and designer Kiko Kostadinov have already realized many joint projects in which the uniqueness of the sneakers took center stage. Otto 958 is a brand or an art design concept project led by Kostadinov. With the <a href=\"\/products\/asics-otto958-x-asics-gel-flexkee-pro-1201a921-001-black-pure-silver\" title=\"Otto958 x Asics Gel-Flexkee Pro\">Gel-Flexkee<\/a>, the focus was not on a running silhouette, but on a skateboarding sneaker. Its properties were developed and tested in the Asics laboratory. The high level of functionality comes primarily from the sole, which has a separate forefoot area. Combined with asymmetric lacing and a toe box reminiscent of a football boot and the oversized tongue, the result is a sneaker that goes completely against the grain and does not conform to the standard.<\/p>","enlarge_text":false}},"image_Ktqexz":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/overkill_notyoureverydaysneaker_9_Kopie.webp","image_width":700,"url":"https:\/\/www.overkillshop.com\/products\/veja-etudes-x-veja-trek-shell-et2303651b-etudes-shark"}},"text_LHednW":{"type":"text","settings":{"text":"<p><strong>Études x Veja Trek-Shell<\/strong><\/p><p>The collaboration between French brand Veja and Parisian label Études epitomizes modern style and a willingness to experiment. The result is a high-quality outdoor sneaker from sustainable production. The Trek-Shell impresses with its technical upper made from water-repellent Trek-Shell fabric, which is made from recycled plastic bottles. This material makes the shoe particularly robust and lightweight at the same time, and it can also be glued, so there are no seams. The midsole is made from sugar cane and offers comfortable cushioning, while the outsole is made from wild rubber from the Amazon rainforest, which provides excellent traction. The sneaker is available in a neutral color palette dominated by natural tones such as beige and dark blue, which emphasizes its outdoor aesthetic. Since its launch, the Études x Veja Trek-Shell has received a lot of attention not only for its eco-friendly approach, but also for its minimalist yet functional design. This collaboration shows how fashion and sustainability can be combined in a stylish way without compromising on functionality. The Trek shell is therefore not only a fashion statement, but also a symbol of conscious consumption.<\/p>","enlarge_text":false}}},"block_order":["image_tnzxEz","text_Nk9EaR","image_cxfUNJ","text_CxV9YK","image_crJGxA","text_bfxiVW","image_Df4Dqd","text_J6w4cW","image_wHUxBN","text_bCJUGW","image_CKURTD","text_pNW8bp","image_mRAeL7","text_MJJxM3","image_4j3TWR","text_ViDXEr","image_6anT6b","text_CWqziN","image_Ktqexz","text_LHednW"],"settings":{"height":"small","text_alignment":"left","full_width":false,"color_scheme":"default"}}},"order":["main","image_with_text_overlay_BEAamT","rich_text_3YdLtm","rich_text_CPKDHq","rich_text_mUnWNK"]}