{"sections":{"main":{"type":"main-article","disabled":true,"settings":{"show_date":false,"show_author":false,"show_article_tags":true,"show_sharing_icons":false,"show_twitter":false,"show_facebook":true,"show_pinterest":true,"show_featured_image":true,"full_width_image":true,"featured_image_height":"huge","enable_title_overlay":false,"overlay_style":"shadow"}},"image_with_text_overlay_NEppEU":{"type":"image-with-text-overlay","settings":{"image":"shopify:\/\/shop_images\/overkill_adidas_20anniversarypack_SPB_3_2x1-8.webp","height":"adapt","height_desktop":600,"height_mobile":460,"image_link":"","full_width":true,"text_alignment":"center center","mobile_overlay_under":false,"overlay_style":"shadow"}},"rich_text_dPUyET":{"type":"rich-text","blocks":{"text_R8er4E":{"type":"text","settings":{"text":"<h5><strong>20 years of Overkill - The adidas Anniversary Pack<\/strong><\/h5>","enlarge_text":true}},"text_hGiaiw":{"type":"text","settings":{"text":"<p>Yes folks, you read that right, Overkill already celebrated its 20th anniversary last year. And because we're all special at Overkill, we're celebrating this anniversary a little later. The doors of the Overkill store on Schlesi opened for the first time in September 2003. A lot has happened since then, but that would go beyond the scope of this article. Today we would like to explain our Anniversary Pack, which we have realized with adidas, in detail.<\/p>","enlarge_text":false}},"image_Chq6rU":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/gif_4_e9b7fc8d-441f-40c6-8c4a-c5769b49f3ee.gif","image_width":700,"url":""}}},"block_order":["text_R8er4E","text_hGiaiw","image_Chq6rU"],"settings":{"height":"small","text_alignment":"left","full_width":false,"color_scheme":"default"}},"featured_product_GRNpk4":{"type":"featured-product","blocks":{"title_gnWbFy":{"type":"title","settings":{}},"price_fQ6Bxj":{"type":"price","settings":{"show_tax_and_shipping":false,"enable_product_reviews_by_price":true}},"vendor_XGiXPx":{"type":"vendor","settings":{}},"buy_buttons_UpK79U":{"type":"buy-buttons","settings":{"show_quantity_selector":false,"select_quantity_selector":"quantity_standard","enable_payment_button":false,"show_backorder_text":false,"show_gift_card_recipient":false}},"description_FNTBcr":{"type":"description","settings":{"show_in_tab":false,"open_tab":false,"icon":""}}},"block_order":["title_gnWbFy","price_fQ6Bxj","vendor_XGiXPx","buy_buttons_UpK79U","description_FNTBcr"],"settings":{"product":"adidas-overkill-x-adidas-eqt-guidance-ig4119-crystal-white-footwear-white-off-white","inventory_transfers_enable":false,"enable_sticky_columns":false,"gallery_size":"small","gallery_layout":"carousel-beside","enable_zoom":true,"show_alt_text":false,"alt_text_icon":"","enable_video_autoplay":false,"enable_video_looping":false,"enable_media_grouping":true,"media_grouping_option":"Color,Colour,Couleur,Farbe"}},"rich_text_PeMXw7":{"type":"rich-text","blocks":{"text_KmT8BE":{"type":"text","settings":{"text":"<p><strong>OVERKILL x adidas ZX 6000<\/strong><\/p><p>Let's start with the Overkill x adidas ZX 6000. When choosing the ZX style, we deliberately opted for the ZX 6000 because it was previously underrepresented. It was a bit of a challenge to feature a different silhouette alongside the popular ZX 8000. The OG ZX 6000 is naturally at the forefront of fans' minds, not least because of its unique colorway. The four-digit ZX series is large and there are often only subtle nuances in how the models differ from one another. The highlight color is blue, one of our boss Marc's favorite colors. In combination with shades of gray and white, it resembles the ZX 4000 & ZX 5000, but that didn't stop us from implementing the model in this way. In terms of the material used, we have opted for the original. However, there is an upgrade from synthetic suede to genuine suede. We deliberately opted for premium products, which gives the model a high-quality look and doesn't look quite as sporty as usual. One thing was particularly important, however, and that was the shiny pinstripe mesh, because even the smallest details are important to us. The labels on the tongues feature the adidas Trefoil and an Overkill tag with a 20 in the background. On the inside, there is also the model name ZX 6000, as well as a tag with the claim: The Best of Overkill, based on the adidas equipment series. The logo on the tongue can also be found on one of three pairs of interchangeable lace tags. On the heel, framed by the plastic stabilizer, there is a 20 and an Overkill quote in graffiti style. The insoles feature the Overkill 20 logo and a torsion wave with adidas and Overkill lettering. As a small but nice detail, there is also the Overkill-Quote on the Torsion bone, which is built into the outsole. The Overkill lettering and an embossed torsion wave are embroidered perpendicular to the stripes. There are also two extra pairs of laces, one blue and one gray.<br\/><\/p>","enlarge_text":false}},"image_dtfHmX":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/gif_1_60c399ae-5416-42ef-b60f-49a12f7e1478.gif","image_width":700,"url":""}},"text_8FXFPk":{"type":"text","settings":{"text":"<p><strong>OVERKILL x adidas Equipment Guidance<\/strong><\/p><p>Now we come to the second model from the Overkill x adidas Anniversary Pack. The Equipment Guidance is one of Marc's favorite silhouettes, also known as Mr. EQT. Since we had a free choice of models this time, it wasn't difficult for us to decide that it had to be the Guidance for our anniversary. In addition to the mesh with the beautiful pattern, nubuck in different shades of gray is used here. Here, too, the materials have been upgraded to offer you a real premium product. As a color highlight, the Equipment Guidance has a bright orange, which can be found on the stripes, the heel and the torsion system in the outsole. The inspiration for this comes from the legendary X-Series of the adidas Radikal from 1992, a small homage to times gone by. The labels on the tongues are once again adorned with the Overkill 20 logo, as well as a modified adidas Performance logo. The Best of Overkill tag can also be found on the inside of the shoe. This model also comes with three different pairs of lace tags, as well as gray and orange laces. The insoles are adorned with the Overkill 20 logo and the modified performance logo. This logo, as well as the 20 as a graffiti tag, is available as a high-quality embroidery on the heels of each model.<\/p>","enlarge_text":false}},"image_MbjBkk":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/gif_5.gif","image_width":700,"url":""}},"text_gTKtVL":{"type":"text","settings":{"text":"<p><strong>OVERKILL x adidas Spiritain 2000<\/strong><\/p><p>When choosing the third model in our birthday trio, it was important to us to create a tech running style. The Y2K running sneakers are currently the top sellers of all brands and these styles are also very popular with our team. However, we didn't want to put our stamp on any of the currently available models, so we rummaged through the adidas archive. When we found the adidas Spiritain 2000, we found out that the model was temporarily sold in the Americas and Asia. So it was a performance model outside of our lifestyle segment, but we fell in love with the silhouette immediately. The adidas archive offers a multitude of tech runners from the millennium, but so far these silhouettes have only hesitantly been brought back onto the market as retro sneakers. With our version on the adidas Spiritain 2000, we also want to take the opportunity to position such sneakers in the lifestyle segment to leave a scent. The construction of the Spiritain 2000 is that of a classic Y2K sneaker. The upper is adorned with a coarse mesh in a creamy white color. Premium materials were also used here. While the material overlays on other models are made of artificial leather, we have spared neither expense nor effort here and had them produced in performance nubuck, which is kept in pure white as a contrast. The contrasting color chosen for this model is a bright green, which blends in perfectly with the modern aesthetic. As a further visual highlight, additional reflective 3M elements have been incorporated to give the model a futuristic design. As usual, the labels on the tongues are tone-on-tone with the Overkill 20 and the adidas Performance logo. The heel features the tagged 20 and the Overkill logo embossed in black. There are also two additional pairs of laces on this model, one in green and one in gray. Modern Overkill lettering is also attached to part of the material overlay. The insoles are adorned with the adidas Performance logo and Overkill 20 lettering in graffiti style.<\/p>","enlarge_text":false}},"image_igz6Px":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/gif_3.gif","image_width":700,"url":""}},"text_xyyVhU":{"type":"text","settings":{"text":"<p><strong>Release:<\/strong> 23.03.2024 - 11:00 am<br\/>Georg-Knorr-Str. 4 - 12681 Berlin<\/p><p>NOTE: The Berlin release is located at an off-site venue <a href=\"https:\/\/maps.app.goo.gl\/JNEnx6Kd46geK5G78\" target=\"_blank\"><span style=\"text-decoration:underline\">Location on Google Maps.<\/span><\/a><\/p><p><strong>Release:<\/strong> 23.03.2024 - 11:00 am<br\/>Hahnenstraße 20 - 50667 Cologne<br\/>In-store first<br\/><strong><br\/>Online release<\/strong> of remaining stock – 10:00 pm<br\/><br\/><strong>First come, first served.<br\/><br\/><\/strong>A limited number of all Friends & Family models will also be available at the release events in Berlin and Cologne.<\/p>","enlarge_text":false}},"image_cnrg4q":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/gif_2.gif","image_width":700,"url":""}}},"block_order":["text_KmT8BE","image_dtfHmX","text_8FXFPk","image_MbjBkk","text_gTKtVL","image_igz6Px","text_xyyVhU","image_cnrg4q"],"settings":{"height":"small","text_alignment":"left","full_width":false,"color_scheme":"default"}}},"order":["main","image_with_text_overlay_NEppEU","rich_text_dPUyET","featured_product_GRNpk4","rich_text_PeMXw7"]}