{"sections":{"main":{"type":"main-article","disabled":true,"settings":{"show_date":false,"show_author":false,"show_article_tags":true,"show_sharing_icons":false,"show_twitter":false,"show_facebook":true,"show_pinterest":true,"show_featured_image":true,"full_width_image":true,"featured_image_height":"huge","enable_title_overlay":false,"overlay_style":"shadow"}},"image_with_text_overlay_D4wNxr":{"type":"image-with-text-overlay","settings":{"image":"shopify:\/\/shop_images\/on-running-banner-01.webp","mobile_image":"shopify:\/\/shop_images\/on_running_35_720_4-5.jpg","height":"adapt","height_desktop":600,"height_mobile":460,"image_link":"","full_width":true,"text_alignment":"center center","mobile_overlay_under":false,"overlay_style":"shadow"}},"rich_text_3YdLtm":{"type":"rich-text","blocks":{"text_PGmjVH":{"type":"text","settings":{"text":"<h1><strong>On Running <br\/>\"Get Weird\" <br\/>Event Recap<\/strong><\/h1>","enlarge_text":true}}},"block_order":["text_PGmjVH"],"settings":{"height":"medium","text_alignment":"center","full_width":false,"color_scheme":"default"}},"rich_text_mUnWNK":{"type":"rich-text","blocks":{"text_Nk9EaR":{"type":"text","settings":{"text":"<p>Finally, the day had come for our joint running event with On Running and the Kraft Runners. About 80 motivated runners gathered on Saturday afternoon at the Drink Shop across from our store at Schlesi to pick up their equipment provided by On Running and prepare for the run. The focus here was of course the On Running Cloudmonster, which caused enthusiasm with almost everyone who had it on their feet for the first time. After everyone had been taken care of, the participants - including the Overkill Running Team - got together for a briefing and an overview of the day.<\/p>","enlarge_text":false}},"image_tnzxEz":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/on-running-03.gif","image_width":700,"url":""}},"text_igaFke":{"type":"text","settings":{"text":"<p>After a warm-up session led by the Kraft Runners, after which some would probably have been out of breath, the run finally got underway. The course went over the Oberbaumbrücke and then turned right onto Stralauer Allee. In order not to disturb the traffic and because it was simply nicer, we ran along the water until we reached the crossing at the Elsenbrücke. Then it went on to the Stralauer peninsula, which was circled clockwise. Rumors claim that here a certain CEO of Overkill found a shortcut thanks to the knowledge of the local conditions and suddenly found himself at the head of the crew again. With the use of Bengalos, it went back to the Elsenbrücke and from there to the final sprint towards the Arena Berlin. One of the Kraft Runners had a big Bluetooth box strapped to his back and the music for good & motivating vibes throughout the run.<\/p>","enlarge_text":false}},"image_9p4Jgi":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/on-running-02.gif","image_width":700,"url":""}},"text_iMhamB":{"type":"text","settings":{"text":"<p>Arriving at the arena, the first ones already had some well-deserved cold drinks and delicious slices from Tiny's Pizza. Others lined up at the On Running Wheel of Fortune, where there were some great prizes to be won. Once most were fed, the first games began. Wheelbarrow races, balloon races, and other running and moving games that you remember from your childhood provided a lot of fun. In order to come down again a little bit, a meditation session took place. After that, everyone had enough energy for the special act of the day. In addition to DJ sets by Moneyama and Medussar, among others, the musical highlight was a performance by the Berlin hyper-pop high-flyer Domiziana. This was also celebrated accordingly by the people, who could also make good use of their regained energy here.<\/p>","enlarge_text":false}},"image_3hygQf":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/on-running-01.gif","image_width":700,"url":""}},"text_GLQy8J":{"type":"text","settings":{"text":"<p>All in all, it was a varied event that was a lot of fun. Thanks to On Running, the Kraft Runners, and Tiny's for making it possible.<\/p>","enlarge_text":false}}},"block_order":["text_Nk9EaR","image_tnzxEz","text_igaFke","image_9p4Jgi","text_iMhamB","image_3hygQf","text_GLQy8J"],"settings":{"height":"small","text_alignment":"left","full_width":false,"color_scheme":"default"}}},"order":["main","image_with_text_overlay_D4wNxr","rich_text_3YdLtm","rich_text_mUnWNK"]}