{"sections":{"main":{"type":"main-article","disabled":true,"settings":{"show_date":false,"show_author":false,"show_article_tags":true,"show_sharing_icons":false,"show_twitter":false,"show_facebook":true,"show_pinterest":true,"show_featured_image":true,"full_width_image":true,"featured_image_height":"huge","enable_title_overlay":false,"overlay_style":"shadow"}},"image_with_text_overlay_D4wNxr":{"type":"image-with-text-overlay","settings":{"image":"shopify:\/\/shop_images\/Overkill_Salomon_XT-4_OG_BW_Carousel_Banner_Liene_copy.webp","mobile_image":"shopify:\/\/shop_images\/20230824-25_Overkill_Salomon_XT-4_OG_ActivationCampaign_Liene_4_copy.webp","height":"adapt","height_desktop":600,"height_mobile":460,"image_link":"","full_width":true,"text_alignment":"center center","mobile_overlay_under":false,"overlay_style":"shadow"}},"rich_text_3YdLtm":{"type":"rich-text","blocks":{"text_PGmjVH":{"type":"text","settings":{"text":"<h1><strong>The Salomon XT-4 - A sneaker between the trail and the urban jungle<\/strong><\/h1>","enlarge_text":false}}},"block_order":["text_PGmjVH"],"settings":{"height":"medium","text_alignment":"center","full_width":false,"color_scheme":"default"}},"rich_text_mUnWNK":{"type":"rich-text","blocks":{"text_Nk9EaR":{"type":"text","settings":{"text":"<p>The French brand Salomon has generated more and more attention in the sneaker world within the last few years. Already in 1947, Salomon was founded in the French Alps. Initially, they focused on winter sports and ski boots, skis, and equipment dominated the product segment. In the 90s, Salomon expanded its range to hiking and performance shoes and within a very short time became one of the market leaders in this segment.<\/p>","enlarge_text":false}},"image_tnzxEz":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/20230824-25_Overkill_Salomon_XT-4_OG_ActivationCampaign_Liene_14_copy.webp","image_width":700,"url":""}},"image_yP9fip":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/20230824-25_Overkill_Salomon_XT-4_OG_ActivationCampaign_Liene_9_copy.webp","image_width":700,"url":""}},"image_ak9tdH":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/20230824-25_Overkill_Salomon_XT-4_OG_ActivationCampaign_Liene_13_copy.webp","image_width":700,"url":""}},"text_UVhLBi":{"type":"text","settings":{"text":"<p><strong>Salomon XT-4 - The trail running shoe<br\/><br\/><\/strong>Today we want to introduce you to one of the most successful models in a little more detail, the Salomon XT-4 OG. Originally, the XT series was designed as trail running shoes. Trail running refers to running in the great outdoors, it goes on unpaved roads sometimes over hilly relief. Compared to other running sports, trail running uses the mind and the entire body, not just the legs. The same applies to the surfaces, you run on small paths, over stones, in the mud, on grass, or even snow. So, it is clear that you also need the right shoes for this and Salomon delivers the XT models, with the best. <br\/><br\/>The XT-4 OG is a robust trail running shoe that offers stability and a cushioned running feel. In years of work and feedback from athletes, the Salomon XT-4 was developed. Its upper is made of a TPU film welded to abrasion-resistant mesh. This application makes the shoe light, it weighs only 358 grams but loses nothing of its robustness. In addition, this upper offers a variety of design options. From gradient colors to photorealistic prints to monochrome designs, everything is possible. The outsole is equipped with Contagrip, a Salomon proprietary tread that is suitable for different surfaces. The midsole features an Agile Chassis System, or ACS, which contributes to the overall stability of the Salomon XT-4. In combination with the Energy Cell midsole made of EVA foam of two different degrees of hardness, the sole provides perfect shock absorption.<\/p>","enlarge_text":false}},"image_kcfg9y":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/OK_Salomon_XT-4OG_Liene_003_copy.webp","image_width":700,"url":""}},"image_yJmqdm":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/OK_Salomon_XT-4OG_Liene_008_copy.webp","image_width":700,"url":""}},"image_X4zbbg":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/OK_Salomon_XT-4OG_Liene_itswillfreeman2023_112_copy_2.webp","image_width":700,"url":""}},"text_DWFiMC":{"type":"text","settings":{"text":"<p><strong>From the terrain to the street<br\/><br\/><\/strong>In the rich history of sneakers, there have always been models that made the leap from sports to casual. It should be mentioned, however, that running silhouettes or basketball sneakers are somewhat better integrated into everyday fashion than outdoor sneakers. But the fashion world is full of trends, which you do not have to understand all, but everyone pulls from it what he likes. One of these rather recent trends is GORPCORE, which has been hip since 2017 at the latest. Gorp is an abbreviation for Good Old Raisins and Peanuts, which is a fruit and nut mixture that is especially popular with outdoor athletes. The Gorpcore scene has no shortage of functional clothing from well-known brands, such as The North Face, Columbia, or Arc'Teryx. But footwear designed for more than just hiking was something none of the major sneaker brands had to offer, aside from Nike ACG sneakers perhaps. While in the beginning sneakers from Salomon were more of a household name to a small group of nerds, the brand's popularity quickly spread. The thoughtful design and the variety of color design options, helped Salomon to sell its shoes to fashionable urbanites. First and foremost, the Salomon XT-4 OG, whose upper material allows creative freedom. In addition, you can determine the look of the welded TPU film, which allows a very technical look. The same applies to the ACS, which makes a powerful impression, especially in the carbon look. Another design feature of the Salomon XT-4 is the quick lace system. Although the laces are skinny, the material is much stronger than flat laces. With the help of small plastic eyelets, the shoe can be tightly laced with one hand, making it easy to put on or take off. <br\/><br\/>Our idea for the editorial of the Salomon XT-4 is inspired by the model itself. Because both as a performance sneakers in the outdoors, as well as a fashionable sneaker for every day, you can use the shoe. Here we have turned the whole thing around, nature is used as a catwalk and the big city is an urban trail run terrain. Now the only question is what will you use the Salomon XT-4 for?!<\/p>","enlarge_text":false}},"image_EgrP7b":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/car-card-salomon-en.gif","image_width":700,"url":""}}},"block_order":["text_Nk9EaR","image_tnzxEz","image_yP9fip","image_ak9tdH","text_UVhLBi","image_kcfg9y","image_yJmqdm","image_X4zbbg","text_DWFiMC","image_EgrP7b"],"settings":{"height":"small","text_alignment":"left","full_width":false,"color_scheme":"default"}}},"order":["main","image_with_text_overlay_D4wNxr","rich_text_3YdLtm","rich_text_mUnWNK"]}