{"sections":{"main":{"type":"main-article","disabled":true,"settings":{"show_date":false,"show_author":false,"show_article_tags":true,"show_sharing_icons":false,"show_twitter":false,"show_facebook":true,"show_pinterest":true,"show_featured_image":true,"full_width_image":true,"featured_image_height":"huge","enable_title_overlay":false,"overlay_style":"shadow"}},"image_with_text_overlay_D4wNxr":{"type":"image-with-text-overlay","settings":{"image":"shopify:\/\/shop_images\/adidas-forum_blog-page-01.jpg","mobile_image":"shopify:\/\/shop_images\/overkill_studio_adidas_gw5924-106.jpg","height":"adapt","height_desktop":600,"height_mobile":460,"image_link":"","full_width":true,"text_alignment":"center center","mobile_overlay_under":false,"overlay_style":"shadow"}},"rich_text_3YdLtm":{"type":"rich-text","blocks":{"text_PGmjVH":{"type":"text","settings":{"text":"<h1><strong>The adidas Forum 84 High \"Little Goat\" with the Clear Sky colorway.<\/strong><\/h1>","enlarge_text":true}}},"block_order":["text_PGmjVH"],"settings":{"height":"medium","text_alignment":"center","full_width":false,"color_scheme":"default"}},"rich_text_mUnWNK":{"type":"rich-text","blocks":{"text_Nk9EaR":{"type":"text","settings":{"text":"<p>The adidas Forum Retro has become a real bestseller for the brand from Herzogenaurach since its return to the market in December 2020. In line with the current zeitgeist, which shows a strong trend toward basketball silhouettes, adidas released many strong colorways of the adidas Forum Retro in recent months. Today, we want to present you here the latest version of the shoe, which has currently appeared in our online shop.<br\/><br\/>This is probably the qualitatively slightly better version of the Forum, the so-called adidas Forum 84, which bears the original release year 1984 in the name. We now offer you the adidas Forum 84 High with the nickname \"Little Goat\" in our assortment. The Forum, which was developed for the 1984 Olympic Games in Los Angeles and named after the location of the Olympic basketball final, the Los Angeles Forum in Inglewood, is an absolute basketball classic that should not be missing in any well-stocked sneaker collection. The color design of the \"Little Goat\" goes back to a pair of Forum Hi from the adidas archive in Herzogenaurach. This was once based on the colors of the University of North Carolina, where the one and only GOAT spent his college days. We're referring here, of course, to MJ, Michael Jordan himself, who gave the North Carolina Tar Heels team the NCAA college championship with the decisive shot in his freshman year of 1982. At the time, His Airness was not yet signed to Nike, but rather played primarily in Converse Fastbreak shoes.<br\/><br\/>After his college career, which he ended by entering the 1984 NBA Draft, MJ and his agent Donald Dell were certainly considering signing a contract with adidas. Because during the preparation for the 1984 Olympics, where he won the gold medal together with the later NBA legends Chris Mullin, Sam Perkins and Patrick Ewing, Michael Jordan also trained in an adidas Forum Hi and learned to appreciate the advantages of the shoe and the brand with the three stripes. The aforementioned Donald Dell had already signed another of his protégés, Patrick Ewing, to an adidas contract. So, Jordan also got the opportunity to test the Forum on the court. In case MJ would have signed with adidas, they had made a prototype in Herzo in the now-released colorway.<br\/><br\/>The shoe really exists in this colorway and with this color blocking in the legendary adidas archive in Herzogenaurach. As mentioned above, the colors white and Carolina Blue, which is sky blue\/light blue, are the colors of the North Carolina Tar Heels. adidas now uses the color code \"Clear Sky\" for this sky blue. On the shoe itself, we see sky blue areas on the Three Stripes, which are once again made of the gorgeous Teasel Suede, on the upper and on the lining. In addition, the Trefoil on the tongue and on the X-Strap have been designed in sky blue. The majority of the upper is in white smooth leather. The sole and the so-called Stabilo Heel, which extends over the midsole around the heel, come in a somewhat matte Off White. Unfortunately, adidas still couldn't bring themselves to go even closer to the original from ‘84 by printing the famous \"Pat Pending\" wording under the Trefoil on the outside of the X-Strap on the one hand and placing the adidas lettering in the small window on the strap on the other. Nevertheless, the colors as well as color blocking and the material are a feast for the eyes.<\/p>","enlarge_text":false}},"image_tnzxEz":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/overkill_studio_adidas_gw5924-106_063c7ee6-d1cf-4488-bb94-c96a5e77e7f9.jpg","image_width":700,"url":""}},"image_eNngMq":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/overkill_studio_adidas_gw5924-100.jpg","image_width":700,"url":""}},"image_zDjt7N":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/overkill_studio_adidas_gw5924-109.jpg","image_width":700,"url":""}},"image_ALTQ4h":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/overkill_studio_adidas_gw5924-108.jpg","image_width":700,"url":""}},"image_LBthKB":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/overkill_studio_adidas_gw5924-110.jpg","image_width":700,"url":""}},"image_MLULPq":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/overkill_studio_adidas_gw5924-114.jpg","image_width":700,"url":""}},"image_jNdfR6":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/overkill_studio_adidas_gw5924-116.jpg","image_width":700,"url":""}}},"block_order":["text_Nk9EaR","image_tnzxEz","image_eNngMq","image_zDjt7N","image_ALTQ4h","image_LBthKB","image_MLULPq","image_jNdfR6"],"settings":{"height":"small","text_alignment":"left","full_width":false,"color_scheme":"default"}}},"order":["main","image_with_text_overlay_D4wNxr","rich_text_3YdLtm","rich_text_mUnWNK"]}