{"sections":{"heading":{"type":"image-with-text-overlay","blocks":{"heading":{"type":"heading","settings":{"title":"FAQ","heading_max_width":15,"title_size":52,"title_size_mobile":32,"use_h1":false}},"text":{"type":"text","settings":{"text":"<p>If talking to a real-life human is more your thing, you can reach our Customer Happiness Team via email (below).<\/p>","enlarge_text":true}}},"block_order":["heading","text"],"disabled":true,"settings":{"height":"fixed","height_desktop":400,"height_mobile":300,"image_link":"","full_width":true,"text_alignment":"center center","mobile_overlay_under":false,"overlay_style":"shadow"}},"main":{"type":"faq-header","settings":{"title":"Quick search","use_h1":false,"text":"","show_search":true,"show_index":true,"index_heading":"Do you need help?"}},"collapsible_tabs_R7qQit":{"type":"collapsible-tabs","blocks":{"question_8mbbVa":{"type":"question","settings":{"title":"Are the products at OVERKILL authentic?","answer":"<p>Yes, 100%. All products on our website and in our stores are absolutely authentic. We get our products directly from the brands and can therefore completely exclude fakes.<br\/><\/p>"}},"question_HApqik":{"type":"question","settings":{"title":"Are the products, that are available online, actually in stock?","answer":"<p>Yes, all the products presented on the website are actually in stock. In the very unlikely event that you order an item that is already out of stock, you will immediately receive a notification from our customer service and the purchase price will be refunded.<br\/><\/p>"}},"question_Ktm9Lc":{"type":"question","settings":{"title":"Can I reserve or pre-order a release item?","answer":"<p>No. We want to give all customers the same chance to purchase a release item. Such releases are often Raffles. For all information regarding raffles, please scroll down.<br\/><\/p>"}},"question_NwPDBR":{"type":"question","settings":{"title":"Will a certain item be available in the future?","answer":"<p>Via our Social Media channels and the <a href=\"\/collections\/soon\" title=\"Soon\">Soon<\/a> section, you can always stay up-to-date on which items will be available soon.<br\/><\/p>"}}},"block_order":["question_8mbbVa","question_HApqik","question_Ktm9Lc","question_NwPDBR"],"settings":{"title":"Products"}},"faq-content-1":{"type":"collapsible-tabs","blocks":{"question_bGPEdR":{"type":"question","settings":{"title":"Do I need an OVERKILL account to order something?","answer":"<p>No, you can also place an order as a guest. Just select the appropriate option in the order process.<\/p>"}},"question_w4U4UN":{"type":"question","settings":{"title":"Was my order successful?","answer":"<p>Once you have placed your order, you will receive a confirmation to the email address you have provided.<\/p><p>Please also check your spam folder. If you do not find confirmation there, please contact us directly via <a href=\"mailto:customerservice@overkill.de\" target=\"_blank\">service@overkill.de<\/a><a href=\"mailto:customerservice@overkill.de.\">.<\/a><\/p>"}},"question-1":{"type":"question","settings":{"title":"What size should I buy?","answer":"<p>If you’re not quite sure which size is right for you, refer to our size guides. They’re located underneath the available sizes for each of our products.<\/p>"}},"question_LkNJtd":{"type":"question","settings":{"title":"Can I pick up my order in one of OVERKILL's stores?","answer":"<p>You can pick up your order after successful online payment in one of our stores in Berlin or Cologne. Just choose Instore Pick Up Berlin or Cologne in the order process. <\/p><p>You will receive an email from us as soon as your order is ready for pickup. Please note that if you order online, you will not be able to pay on-site at the store.<\/p><p>Please also check the opening hours of our stores before you visit us:<br\/><br\/><a href=\"\/pages\/overkill-main-store\" title=\"OVERKILL MAIN STORE\">Overkill Main Store<br\/><\/a><a href=\"\/pages\/overkill-women-store\" title=\"OVERKILL WOMEN STORE\">Overkill Women Store<\/a><br\/><a href=\"\/pages\/overkill-cologne\" title=\"OVERKILL COLOGNE STORE\">Overkill Cologne Store<\/a><\/p>"}},"question-2":{"type":"question","settings":{"title":"How can I cancel my order?","answer":"<p>If you place an order by mistake or change your mind, we can cancel the order as long as it has not been processed by our shipping department. To cancel your order, please contact us by phone or email at <a href=\"mailto:customerservice@overkill.de\">service@overkill.de<\/a>. <a href=\"\/policies\/terms-of-service\" target=\"_blank\" title=\"Terms of Service\">Here<\/a> you can find the conditions of your withdrawal right.<\/p>"}},"question_kNycR6":{"type":"question","settings":{"title":"Can I add items to my order or change my order?","answer":"<p>If you want to add something to your order or change your order in general, please contact our <a href=\"\/pages\/contact\" title=\"Contact\">customer service<\/a>. If your order has not yet been processed by our shipping department, we will be happy to accommodate your request.<br\/><\/p>"}},"question_n83kNT":{"type":"question","settings":{"title":"Can you re-order already sold-out items and sizes?","answer":"<p>No, unfortunately, this is not possible. In rare cases, there are restocks of articles.<br\/><\/p>"}},"question_ptBtKA":{"type":"question","settings":{"title":"Can I exchange items that I bought online in the store?","answer":"<p>Yes, no problem. Please note our 2-week right of withdrawal and that we cannot offer you a cash refund. Refunds will be made the same way you paid.<br\/><\/p>"}},"question_cdjiHX":{"type":"question","settings":{"title":"I just missed the return deadline, can I still send my package back to you?","answer":"<p>Please contact <a href=\"\/pages\/contact\" title=\"Contact\">customer service<\/a>.<\/p>"}},"question_AwJLBk":{"type":"question","settings":{"title":"My package could not be delivered and will be returned to you. How do I proceed?","answer":"<p>In this case, please check the shipment history using your DHL or FedEx tracking and the correctness of your delivery address in your order confirmation. Then contact our customer service if you want us to resend your order and if so, please include your corrected shipping address. Then we can send your order to you again.<\/p>"}},"question_HxMmLa":{"type":"question","settings":{"title":"Do you have the items displayed in the online shop available in your stores?","answer":"<p>Generally yes. The respective availability is displayed on the item page. To be safe, contact our customer service. If an item is not available, we will reserve it and deliver it to one of our Berlin stores on the next business day. For Overkill Cologne, we need a few more business days. <\/p><p>Please note, that some items in our online shop are marked as Online Only. These items are not available in our stores.<br\/><\/p>"}},"question_GMYTny":{"type":"question","settings":{"title":"Can in-store release items also be shipped?","answer":"<p>No, for an in-store release, you would have to complete your purchase on-site.<br\/><\/p>"}}},"block_order":["question_bGPEdR","question_w4U4UN","question-1","question_LkNJtd","question-2","question_kNycR6","question_n83kNT","question_ptBtKA","question_cdjiHX","question_AwJLBk","question_HxMmLa","question_GMYTny"],"settings":{"title":"Ordering"}},"collapsible_tabs_NejFEU":{"type":"collapsible-tabs","blocks":{"question_LPtmXX":{"type":"question","settings":{"title":"Which payment methods does OVERKILL accept?","answer":"<p>We have multiple payment options such as Apple Pay, Google Pay, Credit Card, PayPal and more. <\/p><p>The only exception is <a href=\"\/collections\/raffle\" title=\"Raffle\">Raffles<\/a>, here you can only pay via PayPal. The purchase on account (invoice) is unfortunately not possible.<br\/><\/p>"}},"question_KUnbKx":{"type":"question","settings":{"title":"Is it secure to shop at OVERKILL?","answer":"<p>Yes, shopping with us is absolutely secure. Our online store fulfills the quality criteria of our payment providers.<\/p>"}}},"block_order":["question_LPtmXX","question_KUnbKx"],"settings":{"title":"Payment"}},"faq-content-2":{"type":"collapsible-tabs","blocks":{"para-1":{"type":"content","settings":{"content":"<p>We use all major carriers, and local courier partners. You’ll be asked to select a delivery method during checkout.<\/p>"}},"question-1":{"type":"question","settings":{"title":"What is the shipping policy?","answer":"<p>Once your order is placed, you will receive a confirmation email letting you know that our fulfillment team has received your order. Once your order is fulfilled, you will receive an email notification with your tracking information. Shipping fees are non-refundable in the case of returns.<\/p>"}},"question-2":{"type":"question","settings":{"title":"Do you ship overseas?","answer":"<p>Yes, we ship all over the world. Shipping costs will apply, and will be added at checkout.<\/p>"}},"question_3azPkM":{"type":"question","settings":{"title":"What are the delivery costs?","answer":"<p>Within Germany, delivery is free for orders with a value of 80,00 € or more. For orders with a value below 80,00 €, the shipping costs within Germany are 4,99 €.  A complete overview of all shipping costs for each country and region can be found <a href=\"\/pages\/shipping\" title=\"Shipping\"><span style=\"text-decoration:underline\">here<\/span><\/a>.<br\/><\/p>"}},"question_8QzHTj":{"type":"question","settings":{"title":"What is the delivery time for my order?","answer":"<p>We do our best to ship your items as soon as possible. If the order is placed before 9:00 AM, it will USUALLY be shipped on the same day (workday). If the order was paid in advance, it will be shipped on the day we receive the money. The delivery time within Germany is 1 - 3 working days (Monday - Friday). Deliveries may be delayed due to public holidays. An overview of all delivery times of the respective countries and regions can be found <a href=\"\/pages\/returns\" title=\"Returns\">here<\/a>.<br\/><\/p>"}},"question_8gM8aV":{"type":"question","settings":{"title":"How can I track my order?","answer":"<p>Once we have shipped your parcel, you will receive a tracking link from our logistics partner. To track your order, simply follow the steps described there.<br\/><\/p>"}},"question_gabRMP":{"type":"question","settings":{"title":"How can I view the status of my order?","answer":"<p>Simply log in to your user account with your username. Under Account &gt; Overview you can see the details of your last order. The status of your order means the following: <\/p><ul><li>Pending payment: The payment is still pending. Even if you have already transferred the amount, we may not have received your payment yet.<\/li><li>Canceled: Your order has been canceled.<\/li><li>Confirmed: We have received your payment and your order is currently being processed.<\/li><li>Shipped: Your order has been shipped. Delivery will usually take place within the next 1 - 2 business days (within Germany).<\/li><li>Delivered: Your order has been successfully delivered.<\/li><li>Returned: You have returned one or more items from the order to us.<\/li><li>Refunded: We have refunded the amount for the returned items. <\/li><\/ul>"}},"question_XVBVWd":{"type":"question","settings":{"title":"Which shipping service provider will deliver my package?","answer":"<p>Within Germany, packages are delivered with DHL. In the rest of the EU (and Great Britain) parcels are delivered with FedEx. International shipping outside the EU is either with DHL or FedEx.<br\/><\/p>"}},"question_66FY4i":{"type":"question","settings":{"title":"How can I change my delivery address?","answer":"<p>If you have made a mistake when placing your order, if you want to change your payment- or shipping method, or if you want to change your shipping address, you can do so until it has been processed by our shipping department. The best way to do this is to call us or send an <a href=\"mailto:customerservice@overkill.de\" target=\"_blank\">e-mail<\/a> to our <a href=\"\/pages\/contact\" title=\"Contact\">customer service<\/a>. Adding items to an already placed order may delay processing. <\/p><p>After processing, you will receive an updated order confirmation\/invoice by email. If you created a customer account when you placed your order, you can view the current status there.<br\/><\/p>"}},"question_yY4tXX":{"type":"question","settings":{"title":"Does OVERKILL deliver to my country?","answer":"<p>Usually, we deliver to all countries. Exceptions are Graffiti Cans (spray cans), which we can only ship within Germany. For current reasons, we have to make a few more exceptions temporarily. No shipping to the following countries due to the current COVID-19 situation:<br\/><br\/>Antigua and Barbuda, Equatorial Guinea, Aruba, Azerbaijan, Bahamas, Barbados, Belize, Bermuda, Bhutan, Bolivia, Bonaire, Botswana, Brunei Darussalam, Burkina Faso, Burundi, Cayman Islands, Chile, Côte d'Ivoire, Curaçao, Dominica, Dominican Republic, Cameroon, Cape Verde, Djibouti, Ecuador, Fiji, French Polynesia, Gabon, Gambia, Ghana, Grenada, Guadeloupe, Guinea, Guinea-Bissau, Guyana, Honduras, India, Iran, Jamaica, Cuba, Kenya, Colombia, Comoros, Congo, Congo Democratic Republic, Korea, Republic, Kuwait, Laos, Lesotho, Lebanon, Liberia, Libya, Madagascar, Maldives, Mali, Martinique, Mauritania, Mauritius, Mongolia, Morocco, Namibia, Nepal, New Caledonia, New Zealand, Nicaragua, Niger, Nigeria, Panama, Papua New Guinea, Paraguay, Peru, Philippines, Réunion, Rwanda, Russian Federation, Samoa, Senegal, Sierra Leone, Singapore, Somalia, Sri Lanka, St. Helena\/Ascension\/Tristan, Zimbabwe. Helena\/Ascension\/Tristan da Cunha, St. Kitts and Nevis, St. Lucia, St. Vincent and the Grenadines, Sudan, Suriname, South Africa, Swaziland, Taiwan, Thailand, Trinidad and Tobago, Chad, Tunisia, Tuvalu, Uganda, Uzbekistan, Vanuatu, Wallis and Futuna, Western Sahara, Central African Republic.<br\/><br\/>As soon as we can ship to these countries again, we will do so immediately. Until then, we kindly ask for your understanding.<\/p>"}},"question_pGjpN7":{"type":"question","settings":{"title":"Are returns free of charge?","answer":"<p>We bear the direct costs of returning the goods from a value of 40,00 € if the return takes place within Germany. Orders from all other countries must be returned at your own expense. You can find more information about returns <a href=\"\/pages\/returns\" title=\"Returns\">here<\/a>.<br\/><\/p>"}},"question_LYfhhj":{"type":"question","settings":{"title":"What can I do if the ordered item is damaged or missing?","answer":"<p>Faulty items and poor quality are generally not pleasant topics, especially if the beloved sneakers are defective or the only winter jacket shows a defect just before the ski vacation. Therefore, we always recommend clarifying a complaint with us in advance and we promise to work out an acceptable solution together. <\/p><p>Please contact us via <a href=\"mailto:service@overkill.de\">e-mail<\/a> or call our customer service directly at +49 (0) 30 695 061 26. Please keep in mind that normal wear and tear does not have to be a defect and that it can happen that articles with heavy use do not survive the legal warranty period. More information about complaints can be found <a href=\"\/policies\/terms-of-service\" title=\"Terms of Service\"><span style=\"text-decoration:underline\">here<\/span><\/a>.<br\/><\/p>"}},"question_CK9AJe":{"type":"question","settings":{"title":"Does OVERKILL ship Nike products to my country?","answer":"<p>Due to Nike's regulations, we are not allowed to ship Nike or Jordan products outside the EMEA region. We are allowed to ship Nike products within the EU, Africa, and the Middle East.<br\/><\/p>"}},"question_UjipVc":{"type":"question","settings":{"title":"My package could not be delivered and will be returned to you. How do I proceed?","answer":"<p>In this case, please check the shipment history using your DHL or FedEx tracking and the correctness of your delivery address in your order confirmation. <\/p><p>Then contact our customer service if you want us to resend your order and if so, please include your corrected shipping address. Then we can send your order to you again.<br\/><\/p>"}}},"block_order":["para-1","question-1","question-2","question_3azPkM","question_8QzHTj","question_8gM8aV","question_gabRMP","question_XVBVWd","question_66FY4i","question_yY4tXX","question_pGjpN7","question_LYfhhj","question_CK9AJe","question_UjipVc"],"settings":{"title":"Shipping, Returns & Exchanges"}},"collapsible_tabs_XXX33p":{"type":"collapsible-tabs","blocks":{"question_fRgN9U":{"type":"question","settings":{"title":"What is a Raffle and how can I participate?","answer":"<p>Within the Raffle, you have a chance to win an exclusive right to buy a limited release. Often, the number of people who want to buy, for example, a limited pair of sneakers, exceeds the number of sneakers we have. To make the buying process for limited products and drops as fair as possible, we raffle the right to buy among the participants. <\/p><p>To sign up for a Raffle, click on the link provided on the product page, and follow the steps provided. To ensure that the Raffle process is fair for all involved, you can only participate in our Raffles with a user account. At the end of the raffle, you will be notified by email if you have won.<br\/><\/p>"}},"question_jCg4Tk":{"type":"question","settings":{"title":"Can I change my shipping address after registering?","answer":"<p>After registration for the Raffle, you can unfortunately no longer change your delivery address.<br\/><\/p>"}},"question_qq6Xbt":{"type":"question","settings":{"title":"Can I change my specified size after registration?","answer":"<p>Unfortunately, once you have registered for the Raffle, you will not be able to change the size you entered. <\/p><p>If the Raffle item you have won does not fit, you have the option to return it. Please note our return policy.<br\/><\/p>"}},"question_hMzN6x":{"type":"question","settings":{"title":"How many times can I register for the Raffle if the Raffle item is available in different colors\/styles?","answer":"<p>If there are different colors\/styles of a model in the Raffle, then you can participate in the Raffle once for each color\/style.<br\/><\/p>"}},"question_kEXGTj":{"type":"question","settings":{"title":"I signed up for the Raffle and did not receive a confirmation email. What is the reason for this?","answer":"<p>Please also check your spam folder, sometimes the automatically generated confirmation emails may end up there. In case you cannot find the participation email anywhere, please reach out to our <a href=\"\/pages\/contact\" target=\"_blank\" title=\"Contact\">support team<\/a>. <br\/><\/p>"}},"question_8gNTEE":{"type":"question","settings":{"title":"Why was an amount blocked on my PayPal account?","answer":"<p>In a Raffle, you can only pay with PayPal. When you participate in a Raffle, the amount to be paid in case of a win will be blocked on your PayPal account. This is one of the ways we have chosen to ensure that the draw is as fair as possible and that no one signs up for a Raffle more than once. In this case, if you, unfortunately, do not win the raffle, we will of course release the amount immediately with no further costs to you.<br\/><\/p>"}},"question_HTefXd":{"type":"question","settings":{"title":"What happens to the blocked amount if I win in the raffle?","answer":"<p>Congratulations! If you win the raffle, the blocked amount will be debited from your PayPal account and you can soon look forward to your exclusive pair of sneakers!<br\/><\/p>"}},"question_W76yTe":{"type":"question","settings":{"title":"When will the blocked amount be released if I don't win?","answer":"<p>If you didn't win, the blocked amount will be released to your PayPal account usually within 24 hours. In the rare case of an especially hyped product with a very large number of participants, the release of the blocked amount might take up to 2 working days (Monday - Friday, excluding public holidays). Be sure to try your luck next time!<br\/><\/p>"}},"question_BUA7KD":{"type":"question","settings":{"title":"What are the shipping costs for Raffle items?","answer":"<p>There are no additional shipping costs for the Raffle items. As with regular items, shipping within Germany is free for orders over 80,00 €. For orders below 80,00 € shipping costs of 4,99 € will be charged within Germany. An overview of shipping costs for other countries and regions can be found <a href=\"\/pages\/shipping\" target=\"_blank\" title=\"Shipping\">here<\/a>.<br\/><\/p>"}},"question_eJmLCe":{"type":"question","settings":{"title":"Can I return the Raffle item?","answer":"<p>Yes, you can return the Raffle item as usual. Please refer to our <a href=\"\/pages\/returns\" target=\"_blank\" title=\"Returns\">return policy<\/a>.<\/p>"}},"content_aya4rL":{"type":"content","settings":{"content":"<p>For more details about participating in our Raffles, find our <a href=\"\/pages\/raffle-rules-of-participation\" target=\"_blank\" title=\"RAFFLE - TERMS & CONDITIONS OF PARTICIPATION\">Raffle Rules of Participation here<\/a>. <br\/><\/p>"}}},"block_order":["question_fRgN9U","question_jCg4Tk","question_qq6Xbt","question_hMzN6x","question_kEXGTj","question_8gNTEE","question_HTefXd","question_W76yTe","question_BUA7KD","question_eJmLCe","content_aya4rL"],"settings":{"title":"Raffle"}},"collapsible_tabs_AMwtgw":{"type":"collapsible-tabs","blocks":{"question_k7CghU":{"type":"question","settings":{"title":"How is the shipping of graffiti items being processed?","answer":"<p>The shipping of graffiti items is basically the same as the shipping of other items in our online store. <\/p><p>All products are carefully packed so that no damage occurs during transportation and you can soon enjoy your new equipment!<br\/><\/p>"}},"question_7CimqQ":{"type":"question","settings":{"title":"Can I return Graffiti items?","answer":"<p>Yes, you can return Graffiti items, if they are originally packed.<br\/><\/p>"}},"question_dy87MU":{"type":"question","settings":{"title":"Why can't I order the spray cans abroad?","answer":"<p>Unfortunately, due to security precautions, it is not possible to ship spray cans abroad. We kindly ask for your understanding in this matter. <\/p>"}}},"block_order":["question_k7CghU","question_7CimqQ","question_dy87MU"],"settings":{"title":"Graffiti"}},"contact":{"type":"rich-text","blocks":{"icon":{"type":"icon","settings":{"icon":"chat_bubble"}},"heading":{"type":"heading","settings":{"title":"Get in touch","use_h1":false}},"text":{"type":"text","settings":{"text":"<p>Have questions about your order, or a general enquiry?<\/p>","enlarge_text":true}},"button":{"type":"button","settings":{"button_label":"Contact us","button_link":"shopify:\/\/pages\/contact","button_style":"primary"}}},"block_order":["icon","heading","text","button"],"settings":{"height":"medium","text_alignment":"center","full_width":false,"color_scheme":"default"}},"rich_text_kjzMbw":{"type":"rich-text","blocks":{"heading_myLaEj":{"type":"heading","settings":{"title":"Rich text","use_h1":false}},"text_qB9gEF":{"type":"text","settings":{"text":"<h5><em><strong>Use this text to share information about your store with your customers. Describe products, share announcements, or welcome customers to your store.<\/strong><\/em><\/h5>","enlarge_text":false}}},"block_order":["heading_myLaEj","text_qB9gEF"],"disabled":true,"settings":{"height":"medium","text_alignment":"center","full_width":false,"color_scheme":"default"}}},"order":["heading","main","collapsible_tabs_R7qQit","faq-content-1","collapsible_tabs_NejFEU","faq-content-2","collapsible_tabs_XXX33p","collapsible_tabs_AMwtgw","contact","rich_text_kjzMbw"]}